app/controllers/classifications_controller.rb

  def index
    @classifications = Classification.all
---
SELECT * FROM "classifications"

  def edit
    @classification = Classification.find(params[:id])
---
SELECT * FROM "classifications" WHERE ("classifications"."id" = 2)

  def create

    @classification = Classification.new(params[:classification])

    if params[:topic] && params[:topic][:name]
      @topic = Topic.find_or_create_by_name(params[:topic][:name])
      @classification.topic = @topic
    end

    respond_to do |format|
      if @classification.save
---
INSERT INTO "topics" ("name", "updated_at", "museums_count", "views", "created_at") VALUES('Leicester', '2009-12-01 12:15:55', NULL, 0, '2009-12-01 12:15:55')
SELECT "topics".id FROM "topics" WHERE ("topics"."name" = 'Leicester') LIMIT 1
INSERT INTO "classifications" ("topic_id", "updated_at", "museum_id", "created_at") VALUES(1, '2009-11-30 13:09:13', 1, '2009-11-30 13:09:13')

  def destroy
    @classification = Classification.find(params[:id])
    museum_id = @classification.museum_id
    @classification.destroy
---
SELECT * FROM "classifications" WHERE ("classifications"."id" = 1)
DELETE FROM "classifications" WHERE "id" = 1