app/controllers/homepage_controller.rb

SELECT * FROM "topics" WHERE ("topics"."museums_count" = 1) ORDER BY updated_at ASC LIMIT 8
---
  def show
    @example_topics = Topic.find(:all, :conditions => {:museums_count => 1}, :order => "updated_at ASC", :limit => 8)