app/controllers/museums_controller.rb

  def index
    @museums = Museum.all(:order => :name)
---
SELECT * FROM "museums" ORDER BY name

  def show
    @museum = Museum.find(params[:id])
---
SELECT * FROM "museums" WHERE ("museums"."id" = 1)

  def edit
    @museum = Museum.find(params[:id])
    @topics = Topic.find(:all, :order => :name)
---
SELECT * FROM "museums" WHERE ("museums"."id" = 1)
SELECT * FROM "topics" WHERE ("topics"."id" = 1)

  def create
    @museum = Museum.new(params[:museum])

    respond_to do |format|
      if @museum.save
---
INSERT INTO "museums" ("name", "updated_at", "topics_count", "website", "post_code", "created_at") VALUES('Calverton Folk Museum', '2009-11-30 12:58:06', NULL, '', 'NG14 6HN', '2009-11-30 12:58:06')

  def update
    @museum = Museum.find(params[:id])

    respond_to do |format|
      if @museum.update_attributes(params[:museum])
---
SELECT * FROM "museums" WHERE ("museums"."id" = 257)
UPDATE "museums" SET "street" = 'Castle Meadow Road', "town" = 'Nottingham', "name" = 'Nottinghamshire Archives,', "building" = 'County House', "post_code" = 'NG2 1AG', "updated_at" = '2009-12-01 16:13:58' WHERE "id" = 24

  def destroy
    @museum = Museum.find(params[:id])
    @museum.destroy
---
SELECT * FROM "museums" WHERE ("museums"."id" = 9)
DELETE FROM "museums" WHERE "id" = 9