app/controllers/topics_controller.rb

  def show
    @topic = Topic.find_or_create_by_name(params[:id])
    @topic.increment_view_counter!
---
INSERT INTO "topics" ("name", "updated_at", "museums_count", "views", "created_at") VALUES('trains', '2009-11-30 12:40:32', NULL, NULL, '2009-11-30 12:40:32')
SELECT "topics".id FROM "topics" WHERE ("topics"."name" = 'bridges' AND "topics".id <> 3) LIMIT 1
UPDATE "topics" SET "views" = 1, "updated_at" = '2009-11-30 12:48:15' WHERE "id" = 1